app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["content", ""], ["created_at", "2016-07-03 00:12:10.665150"], ["updated_at", "2016-07-03 00:12:10.665150"]]
---
	def create
		@post = Post.new(params[:post])

		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second post example"], ["updated_at", "2016-07-03 01:25:45.492887"], ["id", 3]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update_attributes(params[:post])